#+STARTUP: showall
elisp:org-toggle-latex-overlays  elisp:org-toggle-pretty-entities 

** fsolve
pydoc:scipy.optimize.fsolve

fsolve is used to find the roots of a known function.

When using fsolve, the objectives and starting information are quite different than for an ODE problem. To use fsolve, we must know the form of the function already.

Here is an example from class.

#+BEGIN_SRC python
import numpy as np
from scipy.optimize import fsolve

Ca0 = 1.5  # mol / L
v0 = 0.15  # L/min
V = 5      # L

Fa0 = Ca0 * v0  # molar flow of A into reactor

def objective(Ca):
    Fa = Ca * v0
    ra = -1.75 * Ca / (1 + 10 * Ca)**2
    return Fa0 - Fa + ra * V

print('steady state 1 = {0}'.format(fsolve(objective, 0.05)))
print('steady state 2 = {}'.format(fsolve(objective, 0.19)))
print('steady state 3 = {}'.format(fsolve(objective, 1.0)))
#+END_SRC

#+RESULTS:
: steady state 1 = [ 0.0740589]
: steady state 2 = [ 0.19680782]
: steady state 3 = [ 1.02913327]

In this example, it is important to note that John needed to specify an initial guess close to each root. 

A more detailed description of how one might iteratively solve for the root of a function can be found here: http://en.wikipedia.org/wiki/Newton's_method

_Concept question:_
It which cases would the Newton method be most likely to fail? 
Which types of functions would you expect to be difficult to find roots of?


